app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "videos"
---
def index
  @total_videos = Video.count