app/controllers/videos_controller.rb

INSERT INTO "videos" ("title", "description", "yt_video_id", "is_complete", "created_at", "updated_at") VALUES ('Encounter with God ', 'Maranatha Gemeinde', NULL, 'f', '2012-08-24 05:40:09.685744', '2012-08-24 05:40:09.685744')
---
  def upload
    @video = Video.create(params[:video])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 2 LIMIT 1
UPDATE "videos" SET "title" = 'Encounter ', "description" = 'Maranatha Gemeinde', "updated_at" = '2012-10-03 08:42:29.532017' WHERE "videos"."id" = 2
---
  def update
    @video     = Video.find(params[:id])
    @result    = Video.update_video(@video, params[:video])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 2 LIMIT 1
UPDATE "videos" SET "yt_video_id" = 'sjw8hBMZWTM', "is_complete" = 't', "updated_at" = '2012-09-05 12:07:58.724102' WHERE "videos"."id" = 2
DELETE FROM "videos" WHERE "videos"."id" = 1
---
  def save_video
    @video = Video.find(params[:video_id])
    if params[:status].to_i == 200
      @video.update_attributes(:yt_video_id => params[:id].to_s, :is_complete => true)
      Video.delete_incomplete_videos

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 2 LIMIT 1
DELETE FROM "videos" WHERE "videos"."id" = 2
---
  def destroy
    @video = Video.find(params[:id])
    if Video.delete_video(@video)

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 2 LIMIT 1
INSERT INTO "comments" ("title", "comment", "commentable_id", "commentable_type", "user_id", "created_at", "updated_at") VALUES ('', 'awesome', 2, 'Video', NULL, '2012-09-05 12:33:36.112818', '2012-09-05 12:33:36.112818')
---
  def add_comment
    @video = Video.find(params[:id])
    if @video.create_comment(params[:video][:comment])